04_perforatedPlate/10_noTextureUniformPerforation/03_baseCaseMappedBC/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    gasOutlet
    {
        type            totalPressure;
        p0              uniform 101325;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           $internalField;
    }
    //~ {
        //~ type            prghPressure;
        //~ rhoName         rho;
        //~ p               uniform 101325;
        //~ value           uniform 101325; // optional initial value
    //~ }
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    holesTop
    //~ {//cyclic BC liquid going out from the bottom comes back from the top
        //~ type            cyclic;
    //~ }
    {
        type            zeroGradient;
    }
    holesBottom
    //~ {//cyclic BC liquid going out from the bottom comes back from the top
        //~ type            cyclic;
    //~ }
    {
        type            zeroGradient;
    }
    //~ {
        //~ type            prghPressure;
        //~ rhoName         rho;
        //~ p               uniform 101325;
        //~ value           uniform 0; // optional initial value
    //~ }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
